benchmarks/socialNetwork/openshift/scripts/benchmark-exp-logs/experiment-2-400.log
Running 1m test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/user-timeline/read
  4 threads and 200 connections
  Thread calibration: mean lat.: 1.527ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.554ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.712ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.574ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.45ms    1.65ms  10.22ms   95.18%
    Req/Sec   103.76    106.02   444.00     85.56%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.08ms
 75.000%    1.23ms
 90.000%    1.58ms
 99.000%   10.22ms
 99.900%   18.96ms
 99.990%   27.63ms
 99.999%   34.53ms
100.000%   34.53ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.877     0.000000            1         1.00
       0.965     0.100000         2002         1.11
       0.992     0.200000         4002         1.25
       1.018     0.300000         6016         1.43
       1.047     0.400000         8005         1.67
       1.082     0.500000         9985         2.00
       1.103     0.550000        10948         2.22
       1.127     0.600000        11937         2.50
       1.152     0.650000        12929         2.86
       1.182     0.700000        13918         3.33
       1.226     0.750000        14923         4.00
       1.253     0.775000        15410         4.44
       1.287     0.800000        15904         5.00
       1.329     0.825000        16405         5.71
       1.380     0.850000        16898         6.67
       1.449     0.875000        17397         8.00
       1.501     0.887500        17647         8.89
       1.581     0.900000        17894        10.00
       1.706     0.912500        18142        11.43
       1.941     0.925000        18389        13.33
       2.295     0.937500        18638        16.00
       2.519     0.943750        18761        17.78
       2.973     0.950000        18887        20.00
       3.471     0.956250        19010        22.86
       4.115     0.962500        19134        26.67
       4.807     0.968750        19258        32.00
       5.243     0.971875        19320        35.56
       5.791     0.975000        19383        40.00
       6.399     0.978125        19445        45.71
       7.167     0.981250        19507        53.33
       7.971     0.984375        19569        64.00
       8.551     0.985938        19600        71.11
       9.103     0.987500        19631        80.00
       9.855     0.989062        19663        91.43
      10.575     0.990625        19694       106.67
      11.263     0.992188        19724       128.00
      11.743     0.992969        19740       142.22
      12.183     0.993750        19755       160.00
      12.847     0.994531        19771       182.86
      13.351     0.995313        19786       213.33
      14.327     0.996094        19802       256.00
      14.703     0.996484        19810       284.44
      15.055     0.996875        19817       320.00
      15.687     0.997266        19825       365.71
      16.671     0.997656        19833       426.67
      17.295     0.998047        19841       512.00
      17.631     0.998242        19845       568.89
      18.031     0.998437        19848       640.00
      18.207     0.998633        19852       731.43
      18.703     0.998828        19856       853.33
      18.975     0.999023        19860      1024.00
      19.199     0.999121        19862      1137.78
      20.095     0.999219        19864      1280.00
      20.175     0.999316        19867      1462.86
      20.495     0.999414        19868      1706.67
      21.375     0.999512        19871      2048.00
      21.375     0.999561        19871      2275.56
      21.407     0.999609        19872      2560.00
      21.439     0.999658        19873      2925.71
      21.759     0.999707        19874      3413.33
      22.047     0.999756        19875      4096.00
      22.047     0.999780        19875      4551.11
      23.471     0.999805        19876      5120.00
      23.471     0.999829        19876      5851.43
      27.631     0.999854        19877      6826.67
      27.631     0.999878        19877      8192.00
      27.631     0.999890        19877      9102.22
      27.743     0.999902        19878     10240.00
      27.743     0.999915        19878     11702.86
      27.743     0.999927        19878     13653.33
      27.743     0.999939        19878     16384.00
      27.743     0.999945        19878     18204.44
      34.527     0.999951        19879     20480.00
      34.527     1.000000        19879          inf
#[Mean    =        1.453, StdDeviation   =        1.650]
#[Max     =       34.496, Total count    =        19879]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  23576 requests in 1.00m, 4.47MB read
  Socket errors: connect 0, read 0, write 0, timeout 112
Requests/sec:    392.82
Transfer/sec:     76.34KB