benchmarks/socialNetwork/openshift/scripts/benchmark-exp-logs/experiment-2-800.log
Running 1m test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/user-timeline/read
  4 threads and 300 connections
  Thread calibration: mean lat.: 1.559ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.524ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.570ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.591ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.76ms    3.49ms  15.62ms   96.74%
    Req/Sec   209.26    154.19   666.00     70.91%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.11ms
 75.000%    1.36ms
 90.000%    2.13ms
 99.000%   15.62ms
 99.900%   50.05ms
 99.990%   82.56ms
 99.999%   92.22ms
100.000%   92.22ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.837     0.000000            1         1.00
       0.942     0.100000         3982         1.11
       0.981     0.200000         8041         1.25
       1.019     0.300000        11991         1.43
       1.061     0.400000        15971         1.67
       1.112     0.500000        19957         2.00
       1.143     0.550000        21920         2.22
       1.177     0.600000        23884         2.50
       1.221     0.650000        25881         2.86
       1.278     0.700000        27880         3.33
       1.358     0.750000        29840         4.00
       1.408     0.775000        30829         4.44
       1.471     0.800000        31825         5.00
       1.556     0.825000        32823         5.71
       1.672     0.850000        33815         6.67
       1.847     0.875000        34810         8.00
       1.964     0.887500        35303         8.89
       2.133     0.900000        35802        10.00
       2.345     0.912500        36301        11.43
       2.631     0.925000        36797        13.33
       3.071     0.937500        37295        16.00
       3.373     0.943750        37542        17.78
       3.727     0.950000        37791        20.00
       4.111     0.956250        38038        22.86
       4.675     0.962500        38287        26.67
       5.447     0.968750        38535        32.00
       5.963     0.971875        38660        35.56
       6.615     0.975000        38785        40.00
       7.699     0.978125        38908        45.71
       8.983     0.981250        39034        53.33
      10.567     0.984375        39157        64.00
      11.527     0.985938        39221        71.11
      12.791     0.987500        39281        80.00
      14.399     0.989062        39343        91.43
      16.263     0.990625        39406       106.67
      18.655     0.992188        39468       128.00
      20.847     0.992969        39499       142.22
      22.655     0.993750        39530       160.00
      25.327     0.994531        39561       182.86
      27.791     0.995313        39592       213.33
      31.135     0.996094        39623       256.00
      32.543     0.996484        39639       284.44
      34.047     0.996875        39654       320.00
      36.799     0.997266        39670       365.71
      38.335     0.997656        39685       426.67
      40.191     0.998047        39701       512.00
      41.855     0.998242        39709       568.89
      43.999     0.998437        39716       640.00
      46.143     0.998633        39724       731.43
      47.679     0.998828        39732       853.33
      51.359     0.999023        39740      1024.00
      52.703     0.999121        39744      1137.78
      53.439     0.999219        39747      1280.00
      54.623     0.999316        39751      1462.86
      56.639     0.999414        39755      1706.67
      58.623     0.999512        39759      2048.00
      59.775     0.999561        39761      2275.56
      61.503     0.999609        39763      2560.00
      62.207     0.999658        39765      2925.71
      66.623     0.999707        39767      3413.33
      70.655     0.999756        39769      4096.00
      72.959     0.999780        39770      4551.11
      73.023     0.999805        39771      5120.00
      73.663     0.999829        39772      5851.43
      78.015     0.999854        39773      6826.67
      82.559     0.999878        39774      8192.00
      82.559     0.999890        39774      9102.22
      82.879     0.999902        39775     10240.00
      82.879     0.999915        39775     11702.86
      85.247     0.999927        39776     13653.33
      85.247     0.999939        39776     16384.00
      85.247     0.999945        39776     18204.44
      88.191     0.999951        39777     20480.00
      88.191     0.999957        39777     23405.71
      88.191     0.999963        39777     27306.67
      88.191     0.999969        39777     32768.00
      88.191     0.999973        39777     36408.89
      92.223     0.999976        39778     40960.00
      92.223     1.000000        39778          inf
#[Mean    =        1.759, StdDeviation   =        3.490]
#[Max     =       92.160, Total count    =        39778]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  46986 requests in 1.00m, 8.92MB read
  Socket errors: connect 0, read 0, write 0, timeout 64
Requests/sec:    782.91
Transfer/sec:    152.15KB