benchmarks/socialNetwork/openshift/scripts/benchmark-exp-logs/experiment-3-40.log
Running 1m test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/user-timeline/read
  2 threads and 40 connections
  Thread calibration: mean lat.: 1.414ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.439ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.46ms    0.93ms   6.43ms   96.34%
    Req/Sec    20.98     47.31   200.00     81.90%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.29ms
 75.000%    1.44ms
 90.000%    1.65ms
 99.000%    6.43ms
 99.900%   11.98ms
 99.990%   15.13ms
 99.999%   15.13ms
100.000%   15.13ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.955     0.000000            1         1.00
       1.095     0.100000          200         1.11
       1.150     0.200000          400         1.25
       1.198     0.300000          600         1.43
       1.247     0.400000          798         1.67
       1.294     0.500000          998         2.00
       1.321     0.550000         1096         2.22
       1.345     0.600000         1198         2.50
       1.375     0.650000         1296         2.86
       1.407     0.700000         1396         3.33
       1.444     0.750000         1495         4.00
       1.466     0.775000         1544         4.44
       1.493     0.800000         1594         5.00
       1.520     0.825000         1645         5.71
       1.554     0.850000         1696         6.67
       1.600     0.875000         1744         8.00
       1.622     0.887500         1768         8.89
       1.653     0.900000         1793        10.00
       1.695     0.912500         1818        11.43
       1.744     0.925000         1843        13.33
       1.820     0.937500         1868        16.00
       1.889     0.943750         1880        17.78
       1.949     0.950000         1893        20.00
       2.155     0.956250         1905        22.86
       2.329     0.962500         1918        26.67
       2.851     0.968750         1930        32.00
       3.111     0.971875         1936        35.56
       3.295     0.975000         1943        40.00
       3.873     0.978125         1949        45.71
       4.119     0.981250         1955        53.33
       4.931     0.984375         1961        64.00
       5.287     0.985938         1964        71.11
       6.003     0.987500         1968        80.00
       6.095     0.989062         1971        91.43
       6.483     0.990625         1974       106.67
       7.231     0.992188         1977       128.00
       7.267     0.992969         1978       142.22
       7.547     0.993750         1980       160.00
       7.847     0.994531         1982       182.86
       7.987     0.995313         1983       213.33
       8.631     0.996094         1985       256.00
       8.631     0.996484         1985       284.44
       9.743     0.996875         1986       320.00
       9.927     0.997266         1987       365.71
      10.135     0.997656         1988       426.67
      11.503     0.998047         1989       512.00
      11.503     0.998242         1989       568.89
      11.503     0.998437         1989       640.00
      11.983     0.998633         1990       731.43
      11.983     0.998828         1990       853.33
      12.783     0.999023         1991      1024.00
      12.783     0.999121         1991      1137.78
      12.783     0.999219         1991      1280.00
      12.783     0.999316         1991      1462.86
      12.783     0.999414         1991      1706.67
      15.127     0.999512         1992      2048.00
      15.127     1.000000         1992          inf
#[Mean    =        1.464, StdDeviation   =        0.926]
#[Max     =       15.120, Total count    =         1992]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2411 requests in 1.00m, 468.54KB read
  Socket errors: connect 0, read 0, write 0, timeout 166
Requests/sec:     40.17
Transfer/sec:      7.81KB